# მომხმარებელს ვთხოვთ ჩაწეროს პირველი ფიგურის კოორდინატები         <-----------------  პირველი ბლოკი

# მომხმარებელს ვთხოვთ ჩაწეროს მეორე ფიგურის კოორდინატები           <-----------------  მეორე ბლოკი

# ვიგებთ რა ფერისაა ის ადგილი სადაც მომხმარებელმა გადაწყვიტა
# დაესვა ფიგურები თუ ფიგურა დგას თეთრზე მისი ხაზების ჯამი          <---------------- მესამე ბლოკი
# არის კენტი მაგალითად : B : 3 არის 2 და 3 : (2 + 3 ) % 2 = 1

# თუ მომხმარებელი გავა ჭადრაკის დაფის გარეთ ან ორივე ფიგურას
# ერთი და იგივე ადგილას დადგავს პროგრამე ეტყვის მას                 <---------------- მეოთხე ბლოკი
# მეტი აღარ დალიო!!!

# თუ თეთრებზე ან შავებზე დგას ორივე ფიგურა
# ვეუბნებით რომ ორივე ფერი დგას თეთრზე ან შავზე                   <------------------ მეხუთე ბლოკი

# თუ ფიგურები დგანან სხვადასხვა ფერებზე
# ვეუბნებით რომ ერთი დგას აქ მეორე აქ                              <---------------- მეექვსე ბლოკი


print("ჩაწერეთ პირველი ფიგურის კოორდინატი ")
x1 = int(input("A = 1 : B = 2 ... : "))  # პირველი ბლოკი
x2 = int(input("1 = 1 : 2 = 2 ... : "))

print("ჩაწერეთ მეორე ფიგურის კოორდინატი ")
y1 = int(input("A = 1 : B = 2 ... : "))  # მეორე ბლოკი
y2 = int(input("1 = 1 : 2 = 2 ... :  "))

z1 = "თეთრზე" if (x1 + x2) % 2 == 1 else "შავზე"  # მესამე ბლოკი
z2 = "თეთრზე" if (y1 + y2) % 2 == 1 else "შავზე"

if x1 > 8 or x1 < 1 or x2 > 8 or x2 <1 or y1 > 8 or y1 < 1 or y2 < 1 or y2 > 8 or (x1 == y1 and y1 == y2) : # მეოთხე ბლოკი
    print("მეტი აღარ დალიო !!!")

else:
    if (z1 == "თეთრზე" and z2 == "თეთრზე") or (z1 == "შავზე" and z2 == "შავზე"):  # მეხუთე ბლოკი
        print("yes : ორივე ფიგურა დგას " + z2)

    else:
        print("NO : პირველი ფიგურა დგას " + z1 + " მეორე კი " + z2)  # მეექვსე ბლოკი